Repository: yahyaBasalama/akram-souq
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Hello World!
ar: مرحبا بكم

# chose_choes
source: Choose an option
ar: إختار خيار

# show_image
source: Show Photo
ar: معرض الصور

source: Camera
ar: الكاميرا

# add_money
source: Add Price
ar: أضف سعر

# error_add_money
source: Price error
ar: خطأ في السعر

# alert_logout
source: Do you want to Exit?
ar: هل تريد الخروج؟

source: No
ar: لا

source: Yes
ar: نعم

# recive_balance_cash
source: Cash Back Balance
ar: إسترجاع رصيد كاش

# recive_balance_nocash
source: Debit Balance Refund
ar: إسترجاع رصيد آجل

# send_balance_cash
source: Send cash balance
ar: إرسال رصيد كاش

# send_balance_nocash
source: Send a Debit balance
ar: إرسال رصيد آجل

# send_balance_marchentcash
source: Send indebtedness to a Store
ar: إرسال مديونية لمحل

# send_balance_marchentcash_admin
source: Sending a debt from the admin
ar: إرسال مديونية من الأدمن

# send_balance_admin
source: Send cash balance from the admin
ar: إرسال رصيد كاش من الأدمن

# send_nobalance_admin
source: Send a Debit balance from the admin
ar: إرسال رصيد آجل من الأدمن

# out_balance_admin
source: Withdraw cash balance from the admin
ar: سحب رصيد كاش من الأدمن

# out_nobalance_admin
source: Withdraw a post-debit balance from the admin
ar: سحب رصيد آجل من الأدمن

# balanceRequest_status_wait
source: Awaiting approval
ar: بانتظار الموافقة

# balanceRequest_status_ok
source: Approved
ar: تمت الموافقة

# balanceRequest_status_ok_admin
source: Approved by admin
ar: تمت موافقة من قبل الأدمن

# balanceRequest_status_ok_merc
source: Approved by the delegate
ar: تمت موافقة من قبل المندوب

# balanceRequest_status_cancel
source: Rejected
ar: تم الرفض

# balanceRequest_status_cancel_admin
source: Rejected by the admin
ar: تم الرفض من قبل الأدمن

# balanceRequest_status_cancel_merc
source: It was rejected by the delegate
ar: تم الرفض من قبل المندوب

# priceName
source: Price
ar: السعر

# first
source: The first
ar: الأول

# sconed
source: second
ar: الثاني

source: third
ar: الثالث

source: Fourth
ar: الرابع

# enable
source: activated
ar: فعال

# disenable
source: Inactive
ar: غير فعال

# bigBalance_alert
source: The amount you entered is greater than the customer's balance
ar: المبلغ الذي أدخلته أكبر من رصيد العميل

# lessThanZero_alert
source: Enter a balance smaller or larger than zero
ar: أدخل رصيد أصغر أو أكبر من صفر

# send_balance_cash_ok
source: A cash balance of the value of
ar: تم ارسال رصيد كاش بقيمة

# befor_from
source: From before
ar: من قبل

# send_balance_nocash_ok
source: A debit balance of the value of
ar: تم ارسال رصيد آجل بقيمة

# ok_balance_cash
source: Approval of Cash Balance
ar: الموافقة على رصيد كاش

# ok_balance_cash_ok
source: Approved cash balance of
ar: تمت الموافقة على رصيد كاش بقيمة

# ok_balance_nocash
source: Approval of a Debit balance
ar: الموافقة على رصيد آجل

# ok_balance_nocash_ok
source: A Debit balance of the value of
ar: تمت الموافقة على رصيد آجل بقيمة

# cancel_balance_cash
source: Cash Balance Rejected
ar: رفض رصيد كاش

# cancel_balance_nocash
source: Debit Balance Rejected
ar: رفض رصيد آجل

# cancel_balance_cash_ok
source: A cash balance of . has been rejected
ar: تم رفض رصيد كاش بقيمة

# cancel_balance_nocash_ok
source: A Debit balance of . has been declined
ar: تم رفض رصيد آجل بقيمة

# discount_bal
source: Debt discount
ar: خصم مديونية

# discount_bal_ok
source: Debt has been deducted
ar: تم خصم مديونية بقيمة

# recive_balance_cash_ok
source: Cashback balance of
ar: تم استرجاع رصيد كاش بقيمة

# recive_balance_nocash_ok
source: A Debit balance of the value of
ar: تم استرجاع رصيد آجل بقيمة

# requst_balance_cash
source: Request Cash Balance
ar: طلب رصيد كاش

# requst_balance_nocash
source: Request a Debit balance
ar: طلب رصيد آجل

# requst_balance_cash_ok
source: A Debit balance of the value of
ar: تم طلب رصيد آجل بقيمة

# requst_balance_nocash_ok
source: A cash balance of the value of
ar: تم طلب رصيد كاش بقيمة

# price
source: Balance
ar: الرصيد

source: Indebtedness
ar: المديونية

source: Log In
ar: تسجيل الدخول

# adminpanel
source: Control Panel
ar: لوحة التحكم

source: printer
ar: الطابعة

# product_edit
source: Product modification
ar: تعديل المنتجات

# mehalte
source: My stores
ar: محلاتي

# earns
source: My Profits
ar: أرباحي

# loginout
source: Log out
ar: تسجيل الخروج

# price_requst
source: Balance Requests
ar: طلبات الرصيد

# price_hostoy_requst
source: Register my balance history
ar: سجل طلبات رصيدي

# mycards
source: My purchases
ar: مشترياتي

# companiesCategories
source: company ratings
ar: تصنيفات الشركات

# wellcome
source: hello
ar: مرحبا

# input_phone_number
source: Enter phone number
ar: أدخل رقم الهاتف

# store_not_regster
source: The store is not registered
ar: المتجر غير مسجل

# store_not_enable
source: The store is inefficient
ar: المتجر غير فعال

# error_otp
source: Something went wrong please resend the code
ar: حدث خطأ ما يرجى إعادة إرسال الرمز

# vert_phone_number
source: Verify phone number
ar: التحقق من رقم الهاتف

# code_otp_error
source: The code is incorrect
ar: الكود غير صحيح

# rester_otp
source: Resend the code
ar: إعادة إرسال الرمز

# edite_number
source: Edit the number
ar: تعديل الرقم

source: Request
ar: طلب

# cancel
source: cancellation
ar: إلغاء

# request_ok
source: Requested
ar: تم الطلب

# are_sure
source: Are you sure?
ar: هل أنت متأكد؟

# requestprice
source: request credit
ar: طلب رصيد

# price_cash
source: cash balance
ar: الرصيد الكاش

# price_debt
source: Debit Balance
ar: الرصيد الآجل

# sum_indebtedness
source: Total Debts
ar: مجموع المديونيات

# price_hostoy
source: Balance history
ar: سجل الرصيد

source: Search
ar: ابحث

# conter
source: the number
ar: العدد

source: Date
ar: التاريخ

# money_send
source: Amount Sent
ar: المبلغ المرسل

# type_mony
source: TYPE OF AMOUNT
ar: نوع المبلغ

# name_store_send_from
source: Name of the Store's address
ar: إسم المحل المرسل إليه

# money_cash_befo_send
source: Cash amount before dispatch
ar: مبلغ الكاش قبل الإرسال

# money_cash_after_send
source: Amount of cash after dispatch
ar: مبلغ الكاش بعد الإرسال

# money_debit_befo_send
source: Debit amount before dispatch
ar: مبلغ الآجل قبل الإرسال

# money_debit_after_send
source: Debit amount after dispatch
ar: مبلغ الآجل بعد الإرسال

# money_indebtedness_befo_send
source: Amount of indebtedness before dispatch
ar: مبلغ المديونية قبل الإرسال

# money_indebtedness_after_send
source: Amount of indebtedness after dispatch
ar: مبلغ المديونية بعد الإرسال

# staus
source: Status
ar: الحالة

# money
source: Amount
ar: المبلغ

# type_reqst_money
source: Type of amount upon request
ar: نوع المبلغ عند الطلب

# type_reqst_after_money
source: Type of amount after order
ar: نوع المبلغ بعد الطلب

# not_requet_price
source: You haven't asked for credit yet.
ar: لم تطلب رصيد بعد

# note_cards
source: There are no cards available
ar: لاتوجد كروت متاحة

# sums
source: Quantity
ar: الكمية

source: Buy
ar: شراء

# buy_ok
source: Purchased. Please check the Purchases section
ar: تم الشراء الرجاء تفقد قسم المشتريات

# price_not_engh
source: The balance is not enough
ar: الرصيد غير كافي

# quantity_not_found
source: Quantity not available
ar: الكمية غير متوفرة

# quantity_less_zero
source: The quantity is smaller than zero
ar: الكمية أصغر من صفر

# enter_quantity
source: Please enter the quantity
ar: الرجاء إدخال الكمية

# companyCategoryName
source: Companies for:
ar: شركات خاصة ب:

# companyCategoryNameall
source: All companies
ar: جميع الشركات

source: Categories
ar: التصنيفات

# not_buy
source: No purchases
ar: لا توجد مشتريات

# printer_notconnected
source: not connected to a printer
ar: لست متصل بطابعة

# show_all_mycards
source: View all my purchases
ar: عرض جميع مشترياتي

# font_size_printer
source: Printer font size
ar: حجم خط الطابعة

# productCompany
source: The company
ar: الشركة

# productName
source: Product
ar: المنتج

# cardSerial
source: Serial
ar: السيريل

source: Card number
ar: رقم الكارت

source: Expiry date
ar: تاريخ الإنتهاء

# broughtPrice
source: the value
ar: القيمة

# balanceAfter
source: Current Balance
ar: الرصيد الحالي

# balanceBefore
source: Previous balance
ar: الرصيد السابق

# sure_buy
source: Confirm your purchase
ar: تأكيد الشراء

# sure_buy_ok
source: Purchased you can print
ar: تم الشراء يمكنك الطباعة

# sure_buy_print
source: Purchased and printed
ar: تم الشراء وتمت الطباعة

# cancel_enable_acount
source: Your account has been deactivated
ar: تم الغاء تفعيل حسابك

# delete_ok
source: you have been deleted
ar: تم حذفك

# not_found_merch
source: Your representative is not there
ar: المندوب الخاص بك ليس موجود

# refersh_price
source: Balance updated
ar: تم تحديث الرصيد

# alert_price
source: ATTENTION: The amount will be deducted from your balance. Make sure the number is correct
ar: تنبيه : سيتم خصم المبلغ من رصيدك تأكد من العدد الصحيح

source: print all
ar: طباعة الكل

source: Share all
ar: مشاركة الكل

source: Share
ar: مشاركة

# companyNameprivete
source: Company's products
ar: منتجات خاصة بشركة

# print_buy
source: Buy & Print
ar: شراء وطباعة

# request_earn
source: Profit Request
ar: طلب الأرباح

# sum_earn
source: total profits
ar: مجموع الأرباح

# name_card
source: Card name
ar: إسم الكارت

# image_card
source: Card Image
ar: صورة الكارت

# price_buy
source: Purchase Price
ar: سعر الشراء

# earn_buy
source: Profit from buying
ar: ربحي من الشراء

# date_buy
source: The date of purchase
ar: تاريخ الشراء

# name_store
source: Store Name
ar: إسم المتجر

# earn_card
source: Profit from products
ar: ربحي من المنتجات

# earn
source: PROFITS
ar: الأرباح

# earn_wait
source: Awaiting profits
ar: الأرباح المنتظرة

# earn_done
source: Profits received
ar: الأرباح المستلمة

# earn_add
source: Ask for profits
ar: اطلب الأرباح

# requst_sum_earn
source: Request a total profit
ar: طلب مجموع ربحي

# accept
source: Consent
ar: موافقة

# accept_price_update_ok
source: Approved and balance updated
ar: تمت الموافقة وتم تحديث الرصيد

# not_price
source: There isn't enough credit
ar: لايوجد رصيد كافي

# error
source: Something went wrong
ar: حدث خطأ ما

# accept_request
source: Approval of the request
ar: موافقة على الطلب

# edit_type_price
source: Adjust balance type
ar: تعديل نوع الرصيد

# noaccept
source: Rejected
ar: رفض

# noaccept_ok
source: It's been rejected.
ar: تم الرفض

# edite_accept
source: Amendment and approval
ar: تعديل وموافقة

# edite
source: modify
ar: تعديل

# edite_ok
source: Modified and updated
ar: تم التعديل جاري التحديث

# add_four_price
source: Add four prices
ar: أضف أربعة أسعار

# choes_comp
source: Choose a company
ar: إختار شركة

# choes_prod
source: Choose a product
ar: إختار منتج

# image_prudact
source: Product image
ar: صورة المنتج

# name_cpmany
source: Company name
ar: إسم الشركة

# price_prod
source: product price
ar: سعر المنتج

# add_myprice
source: add my prices
ar: إضافة أسعاري

# add_price
source: Add Credit
ar: إضافة رصيد

# input_username
source: Type your username
ar: أكتب إسم المستخدم

# input_storename
source: Write down the name of the store
ar: أكتب إسم المحل

# add_ok
source: Balance added, updating
ar: تمت إضافة الرصيد جاري التحديث

# phone_numer_found
source: The phone number is there before
ar: رقم الهاتف موجود قبل

# email_found
source: The email is there before
ar: الإميل موجود قبل

# no_store_edite
source: This store can't edit.
ar: هذا المتجر لايستطيع التعديل

# no_store_add
source: This store can't add.
ar: هذا المتجر لايستطيع الإضافة

# update_data_march
source: Edit delegate information
ar: تعديل معلومات المندوب

# chose_price
source: Choose a price
ar: إختار سعر

source: Username
ar: إسم المستخدم

source: Phone Number
ar: رقم الهاتف

source: email
ar: إميل

source: Address
ar: العنوان

# add
source: Addition
ar: إضافة

# alert_input_money
source: Please enter a balance or transaction amount
ar: الرجاء إدخال رصيد أو مبلغ الصفقة

# prce_less_zero
source: The balance is less than zero
ar: الرصيد اقل من صفر

# sum
source: total
ar: المجموع

# input_price
source: Enter the balance
ar: أدخل الرصيد

# input_money_t
source: Enter the transaction amount
ar: أدخل مبلغ الصفقة

# return_price
source: Refund
ar: إسترجاع رصيد

# return_ok
source: Balance restored, being updated
ar: تمت إسترجاع الرصيد جاري التحديث

source: Cash
ar: كاش

source: Debit
ar: الآجل

# hostory_price_store
source: Register the balance of the store history
ar: سجل رصيد المحل

# enable_ok
source: All stores have been activated and are being updated
ar: تم تفعيل جميع المحلات جاري التحديث

# disenable_ok
source: All stores have been deactivated. Update is in progress
ar: تم إلغاء تفعيل جميع المحلات جاري التحديث

# are_enable_stores
source: Do you want to activate all stores?
ar: هل تريد تفعيل جميع المحلات؟

# are_disenable_stores
source: Do you want to deactivate all stores?
ar: هل تريد إلغاء تفعيل جيمع المحلات؟

# are_enable_store
source: The store is not activated, do you want to activate it?
ar: المتجر غير مفعل، هل تريد تفعيله؟

# are_disenable_store
source: The store is activated, do you want to deactivate it?
ar: المتجر مفعل، هل تريد إلغاء تفعيله؟

source: Add Store
ar: إضافة محلات

source: All stores
ar: جميع المحلات

# show_hostory_price
source: See your balance history
ar: رؤية سجل الرصيد

# cancel_all_enable
source: Deactivate all
ar: إلغاء تفعيل الكل

# all_enable
source: Activate all
ar: تفعيل الكل

# price_debit
source: Debit Balance
ar: الرصيد الآجل

# name_price
source: Price name
ar: إسم السعر

# address_store
source: Store address
ar: عنوان المحل

# shorcut
source: abbreviation
ar: إختصار

source: From Date
ar: من تاريخ

source: To date
ar: إلى تاريخ

# no_eran
source: No profits yet
ar: لا توجد أرباح بعد

# no_earn_wait
source: No profits waiting yet
ar: لا توجد أرباح منتظرة بعد

# no_earn_ok
source: No approved earnings yet
ar: لا توجد أرباح تمت الموافقة عليها بعد

# no_produ
source: No products available
ar: لاتوجد منتجات متاحة
